%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：10-2_Pole_Placement_Controller_Design.m
%% 程序功能：线性反馈控制器-极点配置
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存，
clear all;
close all;
clc;
% 读取Octave控制数据库（注：如使用Matlab，可删除或注释掉本行代码）
pkg load control
%%%%%%%%%%%%%%%%%系统定义%%%%%%%%%%%%%%%%%%%%%
% 定义系统参数
  g=10;
  d=1;
% 定义系统矩阵A
 A=[0 1;g/d 0];
% 定义输入矩阵B
 B=[0;1];
% 定义输出矩阵C
 C = [1, 0];
% 定义直接输入矩阵D
 D = 0;
% 定义仿真时间
tspan = [0: 0.1: 10];
% 状态初始化
z0=[pi/20;0];
%%%%%%%%%%%%%%%%%定义系统微分方程%%%%%%%%%%%%%%%%%%%%%
function  dz = Closedloop_sys(t,z,A,B,C,D,g,d)
%%%%%%%%%%%%%%%%%输入定义%%%%%%%%%%%%%%%%%%%%%
 % 定义控制矩阵
 K = [1+g/d 2];
 % 定义系统输入
 u = -K*z;
 % 定义状态空间方程
 dz = A*z + B*u;
end
% 使用 ode45 求解微分方程
[t, z] = ode45(@(t,z)Closedloop_sys(t,z,A,B,C,D,g,d), tspan, z0);
%%%%%%%%%%%%%%%%%结果%%%%%%%%%%%%%%%%%%%%%%%%%%%
figure(1, 'position',[200 100 600 300]);
% 状态变量结果图
% 系统状态z1结果图
plot(t,z(:,1));
hold on;
% 系统状态z2结果图
plot(t,z(:,2));
grid on;
ylim([-0.4 .4]);
legend("z1","z2");
hold off;

