%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：10-9_Controller_Observer_Combination.m
%% 程序功能：观测器与控制器结合案例
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存，
clear all;
close all;
clc;
% 读取Octave控制数据库（注：如使用Matlab，可删除或注释掉本行代码）
pkg load control

%%%%%%%%%%%%%%%%%系统定义%%%%%%%%%%%%%%%%%%%%%
% 定义系统参数
  g=10;
  d=1;
% 定义系统矩阵A
 A=[0 1;g/d 0];
% 定义输入矩阵B
 B=[0;1];
% 定义输出矩阵C
 C = [1, 0];
% 定义直接输入矩阵D
 D = 0;
% 定义仿真时间
tspan = [0: 0.1: 10];
% 状态初始化
z0=[pi/20;0;0;0];
 %%%%%%%%%%%%%%%%%定义系统微分方程%%%%%%%%%%%%%%%%%%%%%
 function  dz = sys_combined(t, z, A, B, C, D, g, d)
  % 定义控制矩阵
  K = [1+g/d 2];
  % 定义观测矩阵
  L=[4; g/d+4];
  % 定义系统输出
  y= C*z(1:2) - D * K * z(3:4);
  %% 定义真实值Z1，Z2的状态空间方程
  dz_real = A * z(1:2) - B * K * z(3:4);
  %% 定义观测器的状态空间方程
  dz_hat= (A-L*C)*z(3:4)- B * K * z(3:4)+L*y;
  %% 定义ode45求解的向量z
  %% z向量一共有4列，第一列为z1真实值，第二列为z2真实值，第3列为z1估计值，第4列为z2估计值，
  dz = [dz_real; dz_hat];
 end

% 使用 ode45 求解微分方程
[t, z] = ode45(@(t,z)sys_combined(t, z, A, B, C, D, g, d), tspan, z0);
%%%%%%%%%%%%%%%%%结果%%%%%%%%%%%%%%%%%%%%%%%%%%%
figure(1, 'position',[200 100 600 300]);
% 状态变量结果图
% 系统状态z1结果图
plot(t,z(:,1));
hold on;
% 系统状态z2结果图
plot(t,z(:,2));
grid on;
% 状态估计z1_hat结果图
plot(t,z(:,3),'--');
hold on;
% 状态估计z2_hat结果图
plot(t,z(:,4),'--');
grid on;
legend("z1","z2","z1 hat","z2 hat");
hold off;



