%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：2-1_Convolution_Example.m
%% 程序功能：卷积的基本原理和应用
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存，
clear all;
close all;
clc;
% 读取冲击响应
% 本例中是来自与浴缸里面的拍手
IR= audioread('IR.wav');
% 读取原声音文件
talk = audioread ('talk.wav');
% 将冲击响应与原声音文件做卷积，两个声道
mix(:,1) = conv(talk(:,1), IR(:,1));
mix(:,2) = conv(talk(:,2), IR(:,2));
% 播放原声音声音
sound (talk,44100);
pause  (1);
% 播放冲击响应
sound (IR,44100);
pause  (1);
% 播放卷积后声音
sound (mix,44100);


