%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：3-1_Statespace_Example.m
%% 程序功能：使用状态空间方程搭建系统并与传递函数转换
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存，
clear all;
close all;
clc;
% 读取Octave控制和信号数据库（注：如使用Matlab，可删除或注释掉本行代码）
pkg load control
pkg load signal
%%%%%%%%%%%%%%%%%系统定义%%%%%%%%%%%%%%%%%%%%%
% 定义系统变量
m = 1 ;
k = 1 ;
b = 0.5 ;
% 构建系统矩阵A
A = [[0,1];
    [-k/m  -b/m]];
% 构建输入矩阵B
B = [0; 1/m ];
% 构建输出矩阵C
C = [1, 0];
% 构建直接传递矩阵D
D = 0;
% 定义传递函数
sys = ss(A,B,C,D)
% 使用ss2tf语句构建传递函数
[num,den] = ss2tf(A,B,C,D);
G_s=tf(num,den)
