%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：8-1_Root_Locus_Example.m
%% 程序功能：根轨迹举例
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存，
clear all;
close all;
clc;
% 读取Octave控制和信号数据库（注：如使用Matlab，可删除或注释掉本行代码）
pkg load control
% 定义传递函数
s = tf('s');
G_s1 = (s+1)/(s+2);
G_s2 = (s^2+4)/(s^2+2*s+2);
G_s3 = (s+2)/((s+1)*(s+3));
G_s4 = (s+1)/(s*(s+2)*(s+3)*(s+4));
% 绘图
figure(1);
rlocus(G_s1);
figure(2);
rlocus(G_s2);
figure(3);
rlocus(G_s3);
figure(4);
rlocus(G_s4);
