%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：8-3_Lag_Compensator.m
%% 程序功能：滞后补偿器设计
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存
clear all;
close all;
clc;
% 读取Octave控制和信号数据库（注：如使用Matlab，可删除或注释掉本行代码）
pkg load control
%% 定义传递函数
s = tf('s');
G_s = 1/((s+1)*(s+3));
%% 定义开环增益
K = 2;
%% 定义仿真时间
t = 0:0.1:20;
%% 绘制不含补偿器闭环系统根轨迹
subplot(3,2,1);
rlocus(G_s);
subplot(3,2,2);
%% 绘制不含补偿器闭环系统阶跃响应
sys_1 = feedback(K*G_s, 1);
step (sys_1,t);
%%%% 引入超之后补偿器1
sz = -5;
sp = -1;
C1_s = (s-sz)/(s-sp);
%% 绘制含补偿器1闭环系统根轨迹
subplot(3,2,3);
rlocus(G_s*C1_s);
%% 绘制含补偿器1闭环系统阶跃响应
subplot(3,2,4);
sys_2 = feedback(K*G_s*C1_s, 1);
step (sys_2,t);
%%%% 引入超之后补偿器2
sz = -0.5;
sp = -0.1;
C2_s = (s-sz)/(s-sp);
%% 绘制含补偿器2闭环系统根轨迹
subplot(3,2,5);
rlocus(G_s*C2_s);
%% 绘制含补偿器2闭环系统阶跃响应
subplot(3,2,6);
sys_3 = feedback(K*G_s*C2_s, 1);
step (sys_3,t);
