%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 《控制之美-卷一(第二版)》 代码
%% 作者：王天威
%% 清华大学出版社
%% 程序名称：7-1_System_Modeling_Weight_Loss.m
%% 程序功能：体重系统建模
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 程序初始化，清空工作空间，缓存，
clear all;
close all;
clc;
% 读取Octave控制和信号数据库（注：如使用Matlab，可删除或注释掉本行代码）
pkg load control
%%%%%%%%%%%%%%%%%系统定义%%%%%%%%%%%%%%%%%%%%%
%% 定义系统变量
S = 5;
h = 175;
a = 20;
alpha = 1.3;
%% 定义初始体重
x0 = [70];
%% 定义三种不同的热量摄入与支出
Ei = [2500,2100,2500];
Ea = [0, 0, 500];
%% 建立传递函数
G_s = tf([1],[7000,10*alpha]);
%% 定义三种不同的系统输入
d = -alpha*(6.25*h-5*a+S);
u1 = (Ei(1)-Ea(1));
u2 = (Ei(2)-Ea(2));
u3 = (Ei(3)-Ea(3));
%% 定义仿真时间
t = 0: 1: 3000;
%% 系统仿真
%% 输入与扰动以阶跃形式作用在系统上，初始状态以冲激形式作用在系统上
x1 = (u1 + d)* step(G_s,t) + 7000 * x0 * impulse(G_s,t) ;
x2 = (u2 + d)* step(G_s,t) + 7000 * x0 * impulse(G_s,t) ;
x3 = (u3 + d)* step(G_s,t) + 7000 * x0 * impulse(G_s,t) ;
%% 绘图
plot (x1, 'b');
hold on
plot (x2, 'k');
hold on
plot (x3, 'r');
grid on;
hold off;
xlim ([0 3000]);
legend ('Case 1', 'Case 2', 'Case 3');
